Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
//// DEVICES

#define LIGHTS_COUNT (6)                 // Кол-во прожекторов
#define DEVICE_COUNT (LIGHTS_COUNT) + 3  // Кол-во всех устройств (нужно для Alarm'ов)
//// Дозаторы
#define DOSERS_COUNT (3)  // Кол-во прожекторов

doser_t dosersArray[3];
std::unique_ptr<GBasic> doserK{};
std::unique_ptr<GBasic> doserNP{};
std::unique_ptr<GBasic> doserFe{};

//----------------Медиаторы----------------
//Компрессор
Mediator<Sensor> medCompressor;
//Помпа течения
Mediator<Sensor> medFlow;
//Помпа подъемная
Mediator<Sensor> medPump;
//Прожекторы
Mediator<Sensor> medLight;
//Кормушка
// TODO сменить класс Sensor на определенный класс данного устройства
Mediator<Sensor> medFeeder;
// CO2
Mediator<Sensor> medCO2;
//Нагреватель
Mediator<Sensor> medHeater;
//Дозатор
// TODO сменить класс Sensor на определенный класс данного устройства
Mediator<Sensor> medDoser;
Mediator<Doser> medDoser_;
//-----------------------------------------
//Устройства
Sensor* compressor;
Sensor* flow;
Sensor* pump;
Sensor* feeder;
Sensor* co2;
Sensor* heater;
Sensor* doserNew;

std::array<Sensor, DOSERS_COUNT> dosers{Doser(medDoser_, "", Doser::Fe), Doser(medDoser_, "", Doser::K),
                                        Doser(medDoser_, "", Doser::NP)};

std::array<Sensor, LIGHTS_COUNT> lights{Sensor(medLight, "", Sensor::light), Sensor(medLight, "", Sensor::light),
                                        Sensor(medLight, "", Sensor::light), Sensor(medLight, "", Sensor::light),
                                        Sensor(medLight, "", Sensor::light), Sensor(medLight, "", Sensor::light)};
//// Расписания всех устройств
std::array<Scheduler, DEVICE_COUNT> schedules;
//-----------------------------------------

//// METHODS
void test(){
    auto dos=dosers.at(0);
    dos.
}
void getTime() {
    char* strDateTime = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    Serial.printf_P(PSTR("Время %s\n"), String(strDateTime).c_str());
    free(strDateTime);
}

[[maybe_unused]] void printSheduler() {
    auto startDayUTC = 1604966400;
    Serial.printf_P(PSTR("%s\n"), "Информация о расписаниях:");
    for (auto item : schedules) {
        Serial.printf_P(PSTR("%s %s\n"), "Устройство:", item.getDevice()->getName().c_str());
        auto alarmTimeOn = Alarm.read(item.getOn()) + startDayUTC;
        auto tmOn = localtime(&alarmTimeOn);
        char bufferOn[32];
        strftime(bufferOn, 32, "%H:%M:%S", tmOn);
        Serial.printf_P(PSTR("%s %s\n"), "Включение", bufferOn);

        auto alarmTimeOff = Alarm.read(item.getOff()) + startDayUTC;
        auto tmOff = localtime(&alarmTimeOff);
        char bufferOff[32];
        strftime(bufferOff, 32, "%H:%M:%S", tmOff);
        Serial.printf_P(PSTR("%s %s\n\n"), "Выключение", bufferOff);
    }
}

std::string string_format(const std::string& fmt_str, ...) {
    int final_n, n = ((int)fmt_str.size()) * 2;
    std::unique_ptr<char[]> formatted;
    va_list ap;
    while (true) {
        formatted.reset(new char[n]);
        strcpy(&formatted[0], fmt_str.c_str());
        va_start(ap, fmt_str);
        final_n = vsnprintf(&formatted[0], n, fmt_str.c_str(), ap);
        va_end(ap);
        if (final_n < 0 || final_n >= n)
            n += abs(final_n - n + 1);
        else
            break;
    }
    return std::string(formatted.get());
}

void delPtr(const char* p) {
    delete[] p;
}

char* newPtr(size_t len) {
    char* p = new char[len];
    memset(p, 0, len);
    return p;
}

char* getPGMString(PGM_P pgm) {
    size_t len = strlen_P(pgm) + 1;
    char* buf = newPtr(len);
    strcpy_P(buf, pgm);
    buf[len - 1] = 0;
    return buf;
}

void callbackCompressor(Sensor device) {
    Serial.printf_P(PSTR("%s %s\n"), "Вызван callback для устройства", device.getName().c_str());
    char* url = nullptr;
    char* ct = nullptr;
    char* aj = nullptr;
    String urlString;
    String payload;
    url = getPGMString(urlPutCompressor);
    urlString = String(url);

    delPtr(url);
    ct = getPGMString(contentType);
    aj = getPGMString(applicationJson);
    payload = String(device.serialize().c_str());
    if (https.begin(*client, urlString)) {
        https.addHeader(String(ct), String(aj));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.printf_P(PSTR("%s состояние %s\n"), device.getName().c_str(), (device.getState() ? "ON" : "OFF"));
        } else {
            Serial.printf_P(PSTR("%s: %s\n"), "Ошибка", HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "Невозможно подключиться\n");
    }
    delPtr(ct);
    delPtr(aj);
}

void callbackFlow(Sensor device) {
    Serial.printf_P(PSTR("%s %s\n"), "Вызван callback для устройства", device.getName().c_str());
    char* url = nullptr;
    char* ct = nullptr;
    char* aj = nullptr;
    String urlString;
    String payload;
    url = getPGMString(urlPutFlow);
    urlString = String(url);

    delPtr(url);
    ct = getPGMString(contentType);
    aj = getPGMString(applicationJson);
    payload = String(device.serialize().c_str());
    if (https.begin(*client, urlString)) {
        https.addHeader(String(ct), String(aj));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.printf_P(PSTR("%s состояние %s\n"), device.getName().c_str(), (device.getState() ? "ON" : "OFF"));
        } else {
            Serial.printf_P(PSTR("%s: %s\n"), "Ошибка", HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "Невозможно подключиться\n");
    }
    delPtr(ct);
    delPtr(aj);
}

void callbackPump(Sensor device) {
    Serial.printf_P(PSTR("%s %s\n"), "Вызван callback для устройства", device.getName().c_str());
}

void callbackLight(Sensor device) {
    Serial.printf_P(PSTR("%s %s\n"), "Вызван callback для устройства", device.getName().c_str());
    char* url = nullptr;
    char* ct = nullptr;
    char* aj = nullptr;
    String urlString;
    String payload;
    url = getPGMString(urlPutLight);
    urlString = String(url) + String(device.getObjectID().c_str());

    delPtr(url);
    ct = getPGMString(contentType);
    aj = getPGMString(applicationJson);
    payload = String(device.serialize().c_str());
    if (https.begin(*client, urlString)) {
        https.addHeader(String(ct), String(aj));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.printf_P(PSTR("%s состояние %s\n"), device.getName().c_str(), (device.getState() ? "ON" : "OFF"));
        } else {
            Serial.printf_P(PSTR("%s: %s\n"), "Ошибка", HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "Невозможно подключиться\n");
    }
    delPtr(ct);
    delPtr(aj);
}

void callbackFeeder(Sensor device) {
    Serial.printf_P(PSTR("%s %s\n"), "Вызван callback для устройства", device.getName().c_str());
}

void callbackCO2(Sensor device) {
    Serial.printf_P(PSTR("%s %s\n"), "Вызван callback для устройства", device.getName().c_str());
    char* url = nullptr;
    char* ct = nullptr;
    char* aj = nullptr;
    String urlString;
    String payload;
    url = getPGMString(urlPutCO2);
    urlString = String(url);

    delPtr(url);
    ct = getPGMString(contentType);
    aj = getPGMString(applicationJson);
    payload = String(device.serialize().c_str());
    if (https.begin(*client, urlString)) {
        https.addHeader(String(ct), String(aj));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.printf_P(PSTR("%s состояние %s\n"), device.getName().c_str(), (device.getState() ? "ON" : "OFF"));
        } else {
            Serial.printf_P(PSTR("%s: %s\n"), "Ошибка", HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "Невозможно подключиться\n");
    }
    delPtr(ct);
    delPtr(aj);
}

