Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
void callbackHeater(Sensor device) {
    Serial.printf_P(PSTR("%s %s\n"), "Вызван callback для устройства", device.getName().c_str());
}

void callbackDoser(Sensor device) {
    Serial.printf_P(PSTR("%s %s\n"), "Вызван callback для устройства", device.getName().c_str());
}

void initMediators() {
    medCompressor.Register("1", callbackCompressor);
    medFlow.Register("1", callbackFlow);
    medPump.Register("1", callbackPump);
    medLight.Register("1", callbackLight);
    medFeeder.Register("1", callbackFeeder);
    medCO2.Register("1", callbackCO2);
    medHeater.Register("1", callbackHeater);
    medDoser.Register("1", callbackDoser);
}

void createDevicesAndScheduler() {
    compressor = new Sensor(medCompressor, "Компрессор", Sensor::compressor);
    flow = new Sensor(medFlow, "Помпа течения", Sensor::flow);
    pump = new Sensor(medPump, "Помпа подъёмная", Sensor::pump);
    feeder = new Sensor(medFeeder, "Кормушка", Sensor::feeder);
    co2 = new Sensor(medCO2, "CO2", Sensor::co2);
    heater = new Sensor(medHeater, "Нагреватель", Sensor::heater);
    doserNew = new Sensor(medDoser, "Дозатор", Sensor::doser);
    for (int i = 0; i < LIGHTS_COUNT; ++i) {
        std::string buffer = string_format("%s %d", "Прожектор", i + 1);
        auto item = lights.at(i);
        item.setName(buffer);
        item.setMediator(medLight);
        lights.at(i) = item;
        auto schedule = schedules.at(i);
        schedule.setDevice(&(lights.at(i)));
        schedules.at(i) = schedule;
    }
    // Compressor
    auto schedule = schedules.at(6);
    schedule.setDevice(compressor);
    schedules.at(6) = schedule;

    // Flow
    schedule = schedules.at(7);
    schedule.setDevice(flow);
    schedules.at(7) = schedule;

    // CO2
    schedule = schedules.at(8);
    schedule.setDevice(co2);
    schedules.at(8) = schedule;
}

void printDevice(Sensor* device) {
    Serial.printf_P(PSTR("%s\n"), device->sensorInfo().c_str());
}

void printAllDevices() {
    Serial.printf_P(PSTR("%s\n"), "Вывод информации об устройствах:");
    /*
      printDevice(pump);
      printDevice(feeder);
      printDevice(co2);
      printDevice(heater);
      printDevice(doserNew);
*/
    for (auto light : lights) {
        printDevice(&light);
    }
    printDevice(compressor);
    printDevice(flow);
    printDevice(co2);
}

float getSensorTemperature(const uint8_t* sensorAddress) {
    unsigned int rawData;
    onewire.reset();
    onewire.select(sensorAddress);
    onewire.write(0x44, 1);
    onewire.reset();
    onewire.select(sensorAddress);
    onewire.write(0xBE);
    for (uint8_t i = 0; i < 9; i++) {
        sensorData[i] = onewire.read();
    }
    rawData = (sensorData[1] << 8) | sensorData[0];
    float celsius = static_cast<float>(rawData) / static_cast<float>(16.0);
    return celsius;
}

void getSensorsTemperature() {
    sensorTemperatureValue1 = getSensorTemperature(sensorTemperatureAddress1);
    sensorTemperatureValue2 = getSensorTemperature(sensorTemperatureAddress2);
    Serial.printf_P(PSTR(" [T1: %s°]  [T2: %s°]\n"), String(sensorTemperatureValue1).c_str(),
                    String(sensorTemperatureValue2).c_str());
}

void sendMessage(const String& message) {
    char* url = getPGMString(urlPushMessage);
    char* aj = getPGMString(applicationJson);
    char* ct = getPGMString(contentType);
    char* att = getPGMString(androidTickerText);
    char* actitle = getPGMString(androidContentTitle);
    char* actext = getPGMString(androidContentText);
    if (https.begin(*client, String(url))) {
        String data;
        data = R"({"message":")" + message + "\"}";
        https.addHeader(String(ct), String(aj));
        https.addHeader(String(att), F("You just got a push notification!"));
        https.addHeader(String(actitle), F("This is a notification title"));
        https.addHeader(String(actext), F("Push Notifications are cool"));

        int httpCode = https.POST(data);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.println(F("Сообщение отправлено"));
        } else {
            Serial.printf_P(PSTR("sendMessage() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "sendMessage() -> Невозможно подключиться\n");
    }
    delPtr(url);
    delPtr(ct);
    delPtr(att);
    delPtr(actitle);
    delPtr(actext);
    delPtr(aj);
}

void sendMessage(Sensor* device, bool state) {
    char dataMsg[100];
    String stateString = state ? "включение" : "выключение";
    char* p = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    sprintf(dataMsg, "%s: %s", device->getName().c_str(), String(p).c_str());
    delPtr(p);

    char* url = getPGMString(urlPushMessage);
    char* aj = getPGMString(applicationJson);
    char* ct = getPGMString(contentType);
    char* att = getPGMString(androidTickerText);
    char* actitle = getPGMString(androidContentTitle);
    char* actext = getPGMString(androidContentText);

    if (https.begin(*client, String(url))) {
        String data;
        data = R"({"message":")" + stateString + "\"}";
        https.addHeader(String(ct), String(aj));
        https.addHeader(String(att), F("You just got a push notification!"));
        https.addHeader(String(actitle), F("This is a notification title"));
        https.addHeader(String(actext), String(dataMsg));
        int httpCode = https.POST(data);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.println(F("  Сообщение отправлено"));
        } else {
            Serial.printf_P(PSTR("sendMessage() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "sendMessage() -> Невозможно подключиться\n");
    }
    delPtr(url);
    delPtr(ct);
    delPtr(att);
    delPtr(actitle);
    delPtr(actext);
    delPtr(aj);
    stateString.clear();
}

